experiment/results/compare_high_RPS/no_istio_20251231_173158/wrk_logs/wrk_1000rps_rep1.log
Running 2m test @ http://192.168.49.2:30918
  4 threads and 100 connections

  Thread calibration: mean lat.: 2599.770ms, rate sampling interval: 9707ms
  Thread calibration: mean lat.: 2635.495ms, rate sampling interval: 10354ms
  Thread calibration: mean lat.: 2549.745ms, rate sampling interval: 9797ms
  Thread calibration: mean lat.: 2596.468ms, rate sampling interval: 10395ms

-----------------------------------------------------------------------
Test Results @ http://192.168.49.2:30918 
  Thread Stats   Avg      Stdev     99%   +/- Stdev
    Latency    25.63s    12.20s   49.18s    59.03%
    Req/Sec   118.77      6.78   135.00     76.67%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%   25.31s 
 75.000%   35.72s 
 90.000%   42.43s 
 99.000%   49.18s 
 99.900%    0.91m 
 99.990%    0.94m 
 99.999%    0.95m 
100.000%    0.95m 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

    2285.567     0.000000            1         1.00
    9158.655     0.100000         3801         1.11
   13090.815     0.200000         7600         1.25
   17367.039     0.300000        11395         1.43
   21413.887     0.400000        15209         1.67
   25313.279     0.500000        18988         2.00
   27164.671     0.550000        20898         2.22
   29130.751     0.600000        22792         2.50
   31440.895     0.650000        24694         2.86
   33374.207     0.700000        26593         3.33
   35717.119     0.750000        28486         4.00
   36863.999     0.775000        29443         4.44
   37945.343     0.800000        30387         5.00
   39026.687     0.825000        31354         5.71
   40075.263     0.850000        32303         6.67
   41189.375     0.875000        33229         8.00
   41811.967     0.887500        33723         8.89
   42434.559     0.900000        34198        10.00
   43122.687     0.912500        34656        11.43
   43876.351     0.925000        35130        13.33
   44662.783     0.937500        35615        16.00
   45088.767     0.943750        35854        17.78
   45514.751     0.950000        36088        20.00
   45907.967     0.956250        36326        22.86
   46333.951     0.962500        36560        26.67
   46792.703     0.968750        36810        32.00
   47054.847     0.971875        36909        35.56
   47448.063     0.975000        37029        40.00
   47841.279     0.978125        37153        45.71
   48168.959     0.981250        37274        53.33
   48529.407     0.984375        37387        64.00
   48758.783     0.985938        37445        71.11
   48922.623     0.987500        37503        80.00
   49086.463     0.989062        37570        91.43
   49283.071     0.990625        37623       106.67
   49545.215     0.992188        37681       128.00
   49676.287     0.992969        37713       142.22
   49872.895     0.993750        37739       160.00
   50298.879     0.994531        37769       182.86
   50823.167     0.995313        37798       213.33
   51412.991     0.996094        37828       256.00
   51806.207     0.996484        37843       284.44
   52101.119     0.996875        37858       320.00
   52396.031     0.997266        37873       365.71
   52559.871     0.997656        37891       426.67
   52690.943     0.998047        37903       512.00
   53018.623     0.998242        37910       568.89
   53444.607     0.998437        37917       640.00
   53641.215     0.998633        37925       731.43
   53805.055     0.998828        37932       853.33
   54558.719     0.999023        37942      1024.00
   54657.023     0.999121        37944      1137.78
   54755.327     0.999219        37948      1280.00
   54984.703     0.999316        37951      1462.86
   55279.615     0.999414        37956      1706.67
   55312.383     0.999512        37959      2048.00
   55345.151     0.999561        37960      2275.56
   55508.991     0.999609        37962      2560.00
   55607.295     0.999658        37964      2925.71
   55705.599     0.999707        37966      3413.33
   55836.671     0.999756        37967      4096.00
   56131.583     0.999780        37968      4551.11
   56328.191     0.999805        37970      5120.00
   56328.191     0.999829        37970      5851.43
   56360.959     0.999854        37972      6826.67
   56360.959     0.999878        37972      8192.00
   56360.959     0.999890        37972      9102.22
   56393.727     0.999902        37973     10240.00
   56393.727     0.999915        37973     11702.86
   56492.031     0.999927        37974     13653.33
   56492.031     0.999939        37974     16384.00
   56492.031     0.999945        37974     18204.44
   56754.175     0.999951        37975     20480.00
   56754.175     0.999957        37975     23405.71
   56754.175     0.999963        37975     27306.67
   56754.175     0.999969        37975     32768.00
   56754.175     0.999973        37975     36408.89
   56852.479     0.999976        37976     40960.00
   56852.479     1.000000        37976          inf
#[Mean    =    25630.654, StdDeviation   =    12200.627]
#[Max     =    56819.712, Total count    =        37976]
#[Buckets =           27, SubBuckets     =         2048]
-----------------------------------------------------------------------
  42556 requests in 1.50m, 15.56MB read
Requests/sec:    472.77  
Transfer/sec:    177.02KB