experiment/results/compare_high_RPS/no_istio_20251231_173158/wrk_logs/wrk_200rps_rep1.log
Running 2m test @ http://192.168.49.2:30918
  4 threads and 100 connections

  Thread calibration: mean lat.: 61.506ms, rate sampling interval: 408ms
  Thread calibration: mean lat.: 72.201ms, rate sampling interval: 464ms
  Thread calibration: mean lat.: 73.417ms, rate sampling interval: 468ms
  Thread calibration: mean lat.: 69.021ms, rate sampling interval: 412ms

-----------------------------------------------------------------------
Test Results @ http://192.168.49.2:30918 
  Thread Stats   Avg      Stdev     99%   +/- Stdev
    Latency    72.51ms  103.43ms 394.49ms   83.34%
    Req/Sec    49.07     10.73    75.00     71.68%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    5.29ms
 75.000%  132.35ms
 90.000%  227.58ms
 99.000%  394.49ms
 99.900%  561.15ms
 99.990%  706.56ms
 99.999%  782.34ms
100.000%  782.34ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.724     0.000000            1         1.00
       2.029     0.100000         1587         1.11
       2.355     0.200000         3176         1.25
       2.891     0.300000         4763         1.43
       4.287     0.400000         6345         1.67
       5.287     0.500000         7933         2.00
       6.059     0.550000         8732         2.22
       9.015     0.600000         9518         2.50
      94.591     0.650000        10312         2.86
     114.111     0.700000        11104         3.33
     132.351     0.750000        11899         4.00
     142.847     0.775000        12294         4.44
     156.031     0.800000        12693         5.00
     171.263     0.825000        13087         5.71
     187.519     0.850000        13485         6.67
     206.207     0.875000        13881         8.00
     215.807     0.887500        14079         8.89
     227.583     0.900000        14277        10.00
     240.255     0.912500        14475        11.43
     254.207     0.925000        14677        13.33
     269.567     0.937500        14877        16.00
     278.271     0.943750        14971        17.78
     287.487     0.950000        15069        20.00
     299.007     0.956250        15170        22.86
     309.247     0.962500        15270        26.67
     322.047     0.968750        15369        32.00
     329.727     0.971875        15419        35.56
     337.919     0.975000        15466        40.00
     345.599     0.978125        15516        45.71
     355.327     0.981250        15566        53.33
     366.847     0.984375        15615        64.00
     373.503     0.985938        15640        71.11
     381.439     0.987500        15664        80.00
     388.863     0.989062        15689        91.43
     399.359     0.990625        15714       106.67
     410.623     0.992188        15739       128.00
     415.231     0.992969        15751       142.22
     422.143     0.993750        15763       160.00
     433.663     0.994531        15776       182.86
     443.391     0.995313        15788       213.33
     452.351     0.996094        15801       256.00
     459.007     0.996484        15807       284.44
     464.127     0.996875        15813       320.00
     478.719     0.997266        15820       365.71
     487.167     0.997656        15825       426.67
     508.927     0.998047        15832       512.00
     518.143     0.998242        15835       568.89
     520.191     0.998437        15838       640.00
     523.263     0.998633        15841       731.43
     557.055     0.998828        15844       853.33
     580.095     0.999023        15847      1024.00
     583.679     0.999121        15849      1137.78
     595.455     0.999219        15850      1280.00
     608.255     0.999316        15852      1462.86
     620.031     0.999414        15853      1706.67
     643.071     0.999512        15855      2048.00
     649.215     0.999561        15856      2275.56
     649.215     0.999609        15856      2560.00
     667.647     0.999658        15857      2925.71
     676.351     0.999707        15858      3413.33
     699.391     0.999756        15859      4096.00
     699.391     0.999780        15859      4551.11
     699.391     0.999805        15859      5120.00
     706.559     0.999829        15860      5851.43
     706.559     0.999854        15860      6826.67
     758.271     0.999878        15861      8192.00
     758.271     0.999890        15861      9102.22
     758.271     0.999902        15861     10240.00
     758.271     0.999915        15861     11702.86
     758.271     0.999927        15861     13653.33
     782.335     0.999939        15862     16384.00
     782.335     1.000000        15862          inf
#[Mean    =       72.509, StdDeviation   =      103.429]
#[Max     =      781.824, Total count    =        15862]
#[Buckets =           27, SubBuckets     =         2048]
-----------------------------------------------------------------------
  17775 requests in 1.50m, 20.03MB read
  Socket errors: connect 0, read 0, write 0, timeout 77
Requests/sec:    197.47  
Transfer/sec:    227.84KB